esp32-open-mac/esp-wifi-hal/esp-wifi-hal/src/ll.rs
    /// Enable or disable the specified filter.
    pub fn set_filter_enable(&self, interface: usize, filter_bank: RxFilterBank, enabled: bool) {
        Self::regs_internal()
            .filter_bank(filter_bank.into_bits())
            .mask_high(interface)
            .modify(|_, w| w.enabled().bit(enabled));
    }
    /// Check if the filter is enabled.
    pub fn filter_enabled(&self, interface: usize, filter_bank: RxFilterBank) -> bool {
        Self::regs_internal()
            .filter_bank(filter_bank.into_bits())
            .mask_high(interface)
            .read()
            .enabled()
            .bit()
    }
    /// Set the filter address for the specified interface and bank combination.
    ///
    /// This will neither enable the filter nor configure the mask.
    pub fn set_filter_address(
        &self,
        interface: usize,
        filter_bank: RxFilterBank,
        address: &[u8; 6],
    ) {
        let wifi = Self::regs_internal();
        let filter_bank = wifi.filter_bank(filter_bank.into_bits());

        let (address_low, address_high) = split_address(address);
        filter_bank
            .addr_low(interface)
            .write(|w| unsafe { w.bits(address_low) });
        filter_bank
            .addr_high(interface)
            .write(|w| unsafe { w.addr().bits(address_high) });
    }
    /// Set the filter mask for the specified interface and bank combination.
    ///
    /// This will neither enable the filter nor configure the address.
    pub fn set_filter_mask(&self, interface: usize, filter_bank: RxFilterBank, mask: &[u8; 6]) {
        let wifi = Self::regs_internal();
        let filter_bank = wifi.filter_bank(filter_bank.into_bits());

        let (mask_low, mask_high) = split_address(mask);
        filter_bank
            .mask_low(interface)
            .write(|w| unsafe { w.bits(mask_low) });
        // We need to modfiy here, since otherwise we would be clearing the enable bit, which is
        // not part of this functions job.
        filter_bank
            .mask_high(interface)
            .modify(|_, w| unsafe { w.mask().bits(mask_high) });
    }
    /// Clear a filter bank.
    ///
    /// This zeroes out the address and mask, while also disabling the filter as a side effect.
    /// Although the inverse is not true, it makes sense to do this, since that way we can just
    /// reset the [mask_high](crate::esp_pac::wifi::filter_bank::FILTER_BANK::mask_high) field,
    /// saving us one read. This also prevents keeping the slot enabled, while zeroing it, which
    /// would be invalid regardless.
    ///
    /// This will also enable the BSSID check, to bring the filter into a sort of ground state,
    /// so that we can make assumptions about its behaviour when configuring other aspects.
    pub fn clear_filter(&self, interface: usize, filter_bank: RxFilterBank) {
        let wifi = Self::regs_internal();
        let filter_bank = wifi.filter_bank(filter_bank.into_bits());

        filter_bank.addr_low(interface).reset();
        filter_bank.addr_high(interface).reset();
        filter_bank.mask_low(interface).reset();
        // As a side effect, this also disables the filter.
        filter_bank.mask_high(interface).reset();
    }
    /// Reset the filters for an interface.
    ///
    /// This will clear the RX and BSSID filters, as well as enabling the BSSID check and enabling
    /// filtering for unicast and multicast frames.
    pub fn reset_interface_filters(&self, interface: usize) {
        self.clear_filter(interface, RxFilterBank::ReceiverAddress);
        self.clear_filter(interface, RxFilterBank::Bssid);

        self.set_bssid_check_enable(interface, true);
        self.set_filtered_address_types(interface, true, true);
    }
    /// Set the type of addresses that should be filtered.
    ///
    /// If an address type is unfiltered, frames with RAs matching that address type will pass the
    /// filter unconditionally. Otherwise the frame will be filtered as usual.
    pub fn set_filtered_address_types(&self, interface: usize, unicast: bool, multicast: bool) {
        Self::regs_internal()
            .filter_control(interface)
            .modify(|_, w| {
                w.block_unicast()
                    .bit(unicast)
                    .block_multicast()
                    .bit(multicast)
            });
    }
    /// Configure if the BSSID should be checked for RX filtering.
    ///
    /// If the BSSID check is enabled, a frame will only pass the RX filter, if its BSSID matches
    /// the one in the filter. By default this is enabled.
    pub fn set_bssid_check_enable(&self, interface: usize, enabled: bool) {
        Self::regs_internal()
            .filter_control(interface)
            .modify(|_, w| w.bssid_check().bit(enabled));
    }
    /// Configure which control frames pass the filter.
    pub fn set_control_frame_filter(&self, interface: usize, config: &ControlFrameFilterConfig) {
        Self::regs_internal()
            .rx_ctrl_filter(interface)
            .modify(|_, w| {
                w.control_wrapper()
                    .bit(config.control_wrapper)
                    .block_ack_request()
                    .bit(config.block_ack_request)
                    .block_ack()
                    .bit(config.block_ack)
                    .ps_poll()
                    .bit(config.ps_poll)
                    .rts()
                    .bit(config.rts)
                    .cts()
                    .bit(config.cts)
                    .ack()
                    .bit(config.ack)
                    .cf_end()
                    .bit(config.cf_end)
                    .cf_end_cf_ack()
                    .bit(config.cf_end_cf_ack)
            });
    }
    /// Set the parameters for scanning mode.
    ///
    /// We don't entirely know what these parmeters mean.
    pub fn set_scanning_mode_parameters(
        &self,
        interface: usize,
        beacons: bool,
        other_frames: bool,
    ) {
        Self::regs_internal()
            .filter_control(interface)
            .modify(|_, w| {
                w.scan_mode()
                    .bit(beacons)
                    .data_and_mgmt_mode()
                    .bit(other_frames)
            });
    }
    #[inline]
    /// Setup RX filtering.
    ///
    /// This will bring the filters to a known-good state, by enabling filtering for unicast and
    /// multicast frames, filtering all control frames and enabling the BSSID check.
    fn setup_filtering(&self) {
        (0..4).for_each(|interface| {
            self.set_filtered_address_types(interface, true, true);
            self.set_control_frame_filter(interface, &ControlFrameFilterConfig::none());
            self.set_bssid_check_enable(interface, true);
        });
    }

    // TX

