esp32-open-mac/esp-wifi-hal/esp-wifi-hal/src/ll.rs
    /// Get raw transmission status bits.
    unsafe fn raw_tx_status(tx_result: Result<(), ChannelAccessError>) -> u8 {
        let wifi = LowLevelDriver::regs_internal();
        (match tx_result {
            Ok(()) => wifi.txq_state().tx_complete_status().read().bits(),
            Err(ChannelAccessError::Timeout) => {
                wifi.txq_state().tx_error_status().read().bits() >> 0x10
            }
            Err(ChannelAccessError::Collision) => wifi.txq_state().tx_error_status().read().bits(),
        }) as u8
    }
    /// Clear slot transmission status bit.
    unsafe fn clear_tx_slot_bit(tx_result: Result<(), ChannelAccessError>, slot: usize) {
        let wifi = LowLevelDriver::regs_internal();
        match tx_result {
            Ok(()) => wifi
                .txq_state()
                .tx_complete_clear()
                .modify(|_, w| w.slot(slot as u8).set_bit()),
            Err(ChannelAccessError::Timeout) => wifi
                .txq_state()
                .tx_error_clear()
                .modify(|_, w| w.slot_timeout(slot as u8).set_bit()),
            Err(ChannelAccessError::Collision) => wifi
                .txq_state()
                .tx_error_clear()
                .modify(|_, w| w.slot_collision(slot as u8).set_bit()),
        };
    }
    #[inline]
    /// Process a TX status.
    ///
    /// The provided closure will be called for each slot, with the [HardwareTxQueue] as a
    /// parameter.
    ///
    /// NOTE: The reason we encode the TX result using a [Result] is, so that we can reuse the
    /// [ChannelAccessError] enum in the public API.
    ///
    /// # Safety
    /// This has to be static, so that it can be called in an ISR, but it is also expected to only
    /// be called from there, since the Wi-Fi peripheral will have to be initialized there.
    pub unsafe fn process_tx_status(
        tx_result: Result<(), ChannelAccessError>,
        f: impl Fn(HardwareTxQueue),
    ) {
        let raw_status = unsafe { Self::raw_tx_status(tx_result) };
        (0..5)
            .filter(|i| check_bit!(raw_status, bit!(i)))
            .for_each(|queue| {
                // For some reason the slot numbering needs to be reversed when working with the
                // interrupt cause register.
                (f)(HardwareTxQueue::from_hardware_slot(4 - queue).unwrap());
                unsafe { Self::clear_tx_slot_bit(tx_result, queue) };
            });
    }
    #[inline]
    /// Configure the status of a TX slot.
    ///
    /// # Safety
    /// This is only expected to be called in the MAC ISR handler. For other purposes use
    /// [LowLevelDriver::start_tx_queue]
    pub unsafe fn set_tx_queue_status(queue: HardwareTxQueue, queue_status: HardwareTxQueueStatus) {
        Self::regs_internal()
            .tx_slot_config(queue.hardware_slot())
            .plcp0()
            .modify(|_, w| {
                w.slot_valid()
                    .bit(queue_status.valid())
                    .slot_enabled()
                    .bit(queue_status.enabled())
            });
    }
    #[inline]
    /// Start transmission for a queue.
    ///
    /// TODO: Investigate what happens, if the DMA descriptor pointer ist zero.
    pub fn start_tx_queue(&self, queue: HardwareTxQueue) {
        unsafe {
            Self::set_tx_queue_status(queue, HardwareTxQueueStatus::Ready);
        }
    }
    #[inline]
    /// Mark the transmission on a queue as done.
    pub fn tx_done(&self, queue: HardwareTxQueue) {
        unsafe {
            Self::set_tx_queue_status(queue, HardwareTxQueueStatus::Disabled);
        }
        Self::regs_internal()
            .tx_slot_config(queue.hardware_slot())
            .plcp0()
            .reset();
    }
    #[inline]
    /// Returns the result of a transmission from the perspective of the MAC protocol.
    ///
    /// NOTE: This does not indicate [ChannelAccessError]'s, as those are indicated through the
    /// interrupt events. Refer to the docs for [MacProtocolError] for the class of errors this
    /// returns.
    ///
    /// Internally this reads a register called PMD. We do not really know the meaning of that
    /// acronym, but, among other things, the register indicates MAC protocol errors.
    pub fn get_tx_mac_protocol_result(
        &self,
        queue: HardwareTxQueue,
    ) -> Result<(), MacProtocolError> {
        let pmd = Self::regs_internal()
            .pmd(queue.hardware_slot())
            .read()
            .bits();
        let error = ((pmd >> 0xc) & 0xf) as u8;
        let sub_error = (pmd & 0xff) as u8;

        match error {
            0 => Ok(()),
            1 => {
                if sub_error == 1 || sub_error > 2 {
                    Err(MacProtocolError::RtsChannelAccessError(
                        ChannelAccessError::Timeout,
                    ))
                } else {
                    Err(MacProtocolError::Unknown { error, sub_error })
                }
            }
            2 => Err(MacProtocolError::CtsTimeout),
            4 => {
                if sub_error == 0xc0 {
                    Err(MacProtocolError::InvalidKeyId)
                } else if sub_error == 0 {
                    Err(MacProtocolError::CtsTimeout)
                } else if sub_error < 6 && sub_error != 1 {
                    Err(MacProtocolError::AckTimeout)
                } else {
                    Err(MacProtocolError::Unknown { error, sub_error })
                }
            }
            5 => Err(MacProtocolError::AckTimeout),
            _ => Err(MacProtocolError::Unknown { error, sub_error }),
        }
    }
    #[inline]
    /// Set parameters for channel access.
    ///
    /// We aren't really sure about any of these.
    pub fn set_channel_access_parameters(
        &self,
        queue: HardwareTxQueue,
        timeout: usize,
        backoff_slots: usize,
        aifsn: usize,
    ) {
        trace!("AIFSN: {} Backoff Slots: {}", aifsn, backoff_slots);
        Self::regs_internal()
            .tx_slot_config(queue.hardware_slot())
            .config()
            .modify(|_, w| unsafe {
                w.timeout()
                    .bits(timeout as _)
                    .backoff_time()
                    .bits(backoff_slots as _)
                    .aifsn()
                    .bits(aifsn as _)
            });
    }
    #[inline]
    /// Configure the PLCP0 register for a TX queue.
    pub fn set_plcp0(
        &self,
        queue: HardwareTxQueue,
        dma_list_item: Pin<&DmaDescriptor>,
        wait_for_ack: bool,
        enable_rts: bool,
    ) {
        Self::regs_internal()
            .tx_slot_config(queue.hardware_slot())
            .plcp0()
            .modify(|_, w| unsafe {
                w.dma_addr()
                    .bits(
                        (dma_list_item.get_ref() as *const DmaDescriptor).expose_provenance()
                            as u32,
                    )
                    .wait_for_ack()
                    .bit(wait_for_ack)
            });
        if enable_rts {
            // Setting 0x1000_0000 leads to the hardware transmitting CTS-to-Self frames
            // These however seem a bit garbled, so we'll leave it out for now.
            Self::regs_internal()
                .tx_slot_config(queue.hardware_slot())
                .plcp0()
                .modify(|r, w| unsafe { w.bits(r.bits() | 0x0800_0000) });
        }
    }
    #[inline]
    /// Configure the PLCP1 register for a TX queue.
    ///
    /// We are not 100% sure, that our assumption about the bandwidth config is correct.
    pub fn set_plcp1(
        &self,
        queue: HardwareTxQueue,
        rate: TxPhyRate,
        frame_length: usize,
        interface: usize,
        key_slot: Option<u8>,
    ) {
        #[cfg(feature = "esp32s3")]
        {
            // Layout from mac_tx_set_plcp1 of the ESP32-S3 blob: LEN 0..11, RATE 12..16,
            // KEY_SLOT_ID 17.., IS_80211_N 25. The interface ID and the rate the hardware expects
            // the response at live in the "misc" slot register (PAC: PLCP2).
            let hardware_rate = match rate {
                TxPhyRate::Ht(ht) => crate::s3_tx::ht_rate(ht.mcs_index(), ht.short_gi()),
                _ => rate.as_hardware_rate(),
            };
            let plcp1 = (frame_length as u32 & 0xfff)
                | ((hardware_rate as u32 & 0x1f) << 12)
                | ((key_slot.unwrap_or_default() as u32) << 17)
                | ((matches!(rate, TxPhyRate::Ht(_)) as u32) << 25);
            Self::regs_internal()
                .plcp1(queue.hardware_slot())
                .write(|w| unsafe { w.bits(plcp1) });
            let response_rate: u32 = match rate {
                TxPhyRate::HrDsss(_) => rate.as_hardware_rate() as u32,
                TxPhyRate::Ofdm(_) => 0xb,
                TxPhyRate::Ht(ht_rate) => {
                    if ht_rate.mcs_index() % 8 <= 2 {
                        0xb
                    } else {
                        0x9
                    }
                }
            };
            // Keep the bits hal_init leaves in this register (0x0040_0020 on the S3). Bit 5 is
            // the "PLCP2" bit the S2 driver sets for every transmission.
            Self::regs_internal()
                .plcp2(queue.hardware_slot())
                .modify(|r, w| unsafe {
                    w.bits(crate::s3_tx::tx_misc(
                        r.bits(),
                        response_rate as u8,
                        interface,
                    ))
                });
            return;
        }
        #[cfg(not(feature = "esp32s3"))]
        Self::regs_internal()
            .plcp1(queue.hardware_slot())
            .write(|w| unsafe {
                w.len()
                    .bits(frame_length as _)
                    .rate()
                    .bits(rate.as_hardware_rate())
                    .is_80211_n()
                    .bit(matches!(rate, TxPhyRate::Ht(_)))
                    .interface_id()
                    .bits(interface as _)
                    // NOTE: This makes the default value zero, which is a valid key slot ID. However
                    // unless you were to TX a frame, that was perfectly crafted to match the key ID,
                    // address and interface of key slot zero, and have a CCMP header. I guess this
                    // isn't an issue then.
                    .key_slot_id()
                    .bits(key_slot.unwrap_or_default() as _)
                    // Maybe my guess about bandwidth was wrong in the end.
                    .bandwidth()
                    .set_bit()
            });
    }
    #[inline]
    /// Configure the PLCP2 register for a TX queue.
    ///
    /// Currently this doesn't do much, except setting a bit with unknown meaning to one.
    pub fn set_plcp2(&self, queue: HardwareTxQueue) {
        // On the ESP32-S3 this register is written by `set_plcp1`.
        #[cfg(feature = "esp32s3")]
        let _ = queue;
        #[cfg(not(feature = "esp32s3"))]
        Self::regs_internal()
            .plcp2(queue.hardware_slot())
            .write(|w| w.unknown().set_bit());
    }
    #[inline]
    /// Set the duration for a TX queue.
    pub fn set_duration(&self, queue: HardwareTxQueue, duration: u16) {
        let duration = duration as u32;
        Self::regs_internal()
            .duration(queue.hardware_slot())
            .write(|w| unsafe { w.bits(duration | (duration << 16)) });
    }
    #[inline]
    /// Configure the HT related register for a TX queue.
    pub fn set_ht_parameters(
        &self,
        queue: HardwareTxQueue,
        mcs: u8,
        is_short_gi: bool,
        frame_length: usize,
    ) {
        #[cfg(feature = "esp32s3")]
        {
            // From mac_tx_set_htsig of the ESP32-S3 blob (non-STBC path).
            Self::regs_internal()
                .ht_sig(queue.hardware_slot())
                .write(|w| unsafe { w.bits(crate::s3_tx::ht_sig(mcs, is_short_gi, frame_length)) });
            Self::regs_internal()
                .ht_unknown(queue.hardware_slot())
                .write(|w| unsafe {
                    w.bits(
                        (frame_length as u32 & 0x7ffff) | 0x40_0000 | ((mcs as u32 & 0b111) << 28),
                    )
                });
            Self::regs_internal()
                .plcp2(queue.hardware_slot())
                .modify(|r, w| unsafe { w.bits((r.bits() & 0xff3f_ffff) | 0x40_0000) });
        }
        #[cfg(not(feature = "esp32s3"))]
        {
            Self::regs_internal()
                .ht_sig(queue.hardware_slot())
                .write(|w| unsafe {
                    w.bits(
                        (mcs as u32 & 0b111)
                            | ((frame_length as u32 & 0xffff) << 8)
                            | (0b111 << 24)
                            | ((is_short_gi as u32) << 31),
                    )
                });
            Self::regs_internal()
                .ht_unknown(queue.hardware_slot())
                .write(|w| unsafe { w.bits(frame_length as u32 | 0x50000) });
        }
    }

    // Crypto

