esp32-open-mac/esp-wifi-hal/esp-wifi-hal/src/ll.rs
    #[inline]
    /// Initialize hardware cryptography.
    ///
    /// This is pretty much the same as `hal_crypto_init`, except we init crypto for all
    /// interfaces, not just zero and one.
    fn setup_crypto(&self) {
        // Enable crypto for all interfaces.
        (0..INTERFACE_COUNT).for_each(|interface| {
            // Writing 0x3_000 in the crypto control register of an interface seem to be used to enable
            // crypto for that interface.
            Self::regs_internal()
                .crypto_control()
                .interface_crypto_control(interface)
                .write(|w| unsafe { w.bits(0x0003_0000) });
        });

        // Resetting the general crypto control register effectively marks all slots as unused.
        Self::regs_internal()
            .crypto_control()
            .general_crypto_control()
            .reset();
    }
    /// Enable or disable a key slot.
    ///
    /// As soon, as the key slot is enabled, the hardware will treat the data in it as valid.
    pub fn set_key_slot_enable(&self, key_slot: usize, enabled: bool) {
        Self::regs_internal()
            .crypto_control()
            .crypto_key_slot_state()
            .modify(|_, w| w.key_slot_enable(key_slot as u8).bit(enabled));
    }
    /// Check if the key slot is enabled.
    pub fn key_slot_enabled(&self, key_slot: usize) -> bool {
        Self::regs_internal()
            .crypto_control()
            .crypto_key_slot_state()
            .read()
            .key_slot_enable(key_slot as u8)
            .bit()
    }
    /// Set the cryptographic key for the specified key slot.
    ///
    /// # Panics
    /// If `key` is longer than 32 bytes, or `key_slot` larger than 24.
    pub fn set_key(&self, key_slot: usize, key: &[u8]) {
        assert!(key.len() <= 32, "Keys can't be longer than 32 bytes.");
        let wifi = Self::regs_internal();
        let key_slot = wifi.crypto_key_slot(key_slot);

        // Let's hope the compiler is smart enough to emit no panics this way.
        let (full_key_words, remaining_key_bytes) = key.as_chunks::<4>();

        // We first write the full key words...
        for (word, key_value) in full_key_words
            .iter()
            .copied()
            .zip(key_slot.key_value_iter())
        {
            key_value.write(|w| unsafe { w.bits(u32::from_ne_bytes(word)) });
        }
        // and then the remaining bytes.
        if !remaining_key_bytes.is_empty() {
            assert!(remaining_key_bytes.len() < 4);

            let mut temp = [0u8; 4];
            temp[..remaining_key_bytes.len()].copy_from_slice(remaining_key_bytes);
            key_slot
                .key_value(full_key_words.len())
                .write(|w| unsafe { w.bits(u32::from_ne_bytes(temp)) });
        }
    }
    /// Set the key slot parameters.
    ///
    /// This will also set the 22nd bit, of the [addr_high register](crate::esp_pac::wifi::crypto_key_slot::addr_high),
    /// the purpose of which we don't really know. In the PACs, it can be found at
    /// [unknown](crate::esp_pac::wifi::crypto_key_slot::addr_high::W::unknown).
    ///
    /// The rationale behind having a single function setting all the parameters, is that it's unlikely
    /// one of these will change, while the key slot is in use. It is however possible, that the key
    /// gets changed, so that's in a separate function.
    pub fn set_key_slot_parameters(
        &self,
        key_slot: usize,
        key_slot_parameters: &KeySlotParameters,
    ) {
        let wifi = Self::regs_internal();
        let key_slot = wifi.crypto_key_slot(key_slot);
        let (address_low, address_high) = split_address(&key_slot_parameters.address);

        key_slot
            .addr_low()
            .write(|w| unsafe { w.bits(address_low) });
        key_slot.addr_high().modify(|_, w| unsafe {
            w.key_id()
                .bits(key_slot_parameters.key_id)
                .pairwise_key()
                .bit(key_slot_parameters.pairwise)
                .group_key()
                .bit(key_slot_parameters.group)
                .wep_104()
                .bit(key_slot_parameters.wep_104)
                .algorithm()
                .bits(key_slot_parameters.algorithm)
                .interface_id()
                .bits(key_slot_parameters.interface)
                .unknown()
                .set_bit()
                .addr()
                .bits(address_high)
        });
    }
    /// Clear all data from a key slot.
    ///
    /// This will not disable the key slot, use [Self::set_key_slot_enable] for that.
    pub fn clear_key_slot(&self, key_slot: usize) {
        let wifi = Self::regs_internal();
        let key_slot = wifi.crypto_key_slot(key_slot);

        // Effectively zeroes the entire slot.
        key_slot.addr_low().reset();
        key_slot.addr_high().reset();
        key_slot.key_value_iter().for_each(KEY_VALUE::reset);
    }
    /// Set the crypto parameters for an interface.
    ///
    /// Management Frame Protection (MFP) and Signaling and Payload Protection (SPP) are configured
    /// globally for every interface, as well as the use of an Authenticated Encryption with
    /// Associated Data (AEAD) system. It is not possible to use non-AEAD ciphers (i.e. WEP) in
    /// parallel with AEAD ciphers (all others) on the same interface.
    ///
    /// NOTE: SMS4 (WAPI) is not currently supported, as information about it is scarce and it's
    /// not really used in practice.
    pub fn set_interface_crypto_parameters(
        &self,
        interface: usize,
        protect_management_frames: bool,
        protect_signaling_and_payload: bool,
        is_cipher_aead: bool,
    ) {
        Self::regs_internal()
            .crypto_control()
            .interface_crypto_control(interface)
            .modify(|r, w| unsafe {
                w.bits(r.bits() | 0x10103)
                    .spp_enable()
                    .bit(protect_signaling_and_payload)
                    .pmf_disable()
                    .bit(!protect_management_frames)
                    .aead_cipher()
                    .bit(is_cipher_aead)
                    .sms4()
                    .clear_bit()
            });
    }
    /// Set the status of SMS4 (WAPI) encapsulation.
    ///
    /// SMS4 needs to be enabled here, if you want to use it elsewhere. Our current understanding
    /// is, that WAPI can't be used concurrently with other ciphers.
    pub fn set_sms4_status(&self, enabled: bool) {
        Self::regs_internal()
            .crypto_control()
            .general_crypto_control()
            .modify(|r, w| unsafe {
                w.bits(if enabled {
                    r.bits() | 0x00ffff00
                } else {
                    r.bits() & 0xff0000ff
                })
            });
    }

